Console.WriteLine("Hello, World!");

// Написать программу, которая из имеющегося массива строк формирует новый массив из строк,
//длина которых меньше, либо равна 3 символам.

string[] array = {"Hello", "2", "world", ":-)"};
